app/controllers/proposal_viewer_controller.rb

  def show
    @client = Client.find(:first, :conditions => ["id = ?", params[:id]], :include => [:proposals, {:proposals => :proposal_sections}])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)
SELECT * FROM "proposal_sections" WHERE ("proposal_sections".proposal_id = 1) LIMIT 1
SELECT * FROM "proposals" WHERE ("proposals".client_id = 1) ORDER BY proposals.id DESC LIMIT 1